Revit 2027 API
PanelScheduleView.GetLoadClassificationParamValue Method
 Gets the load classification parameter value.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetLoadClassificationParamValue(
	ElementId parameterId,
	int nRow,
	int nCol
)
Public Function GetLoadClassificationParamValue (
	parameterId As ElementId,
	nRow As Integer,
	nCol As Integer
) As String
public:
String^ GetLoadClassificationParamValue(
	ElementId^ parameterId,
	int nRow,
	int nCol
)
member GetLoadClassificationParamValue :
        parameterId : ElementId *
        nRow : int *
        nCol : int -> string
Parameters
parameterId ElementId
 Parameter Id of the Load Classification
nRow Int32
 Row Number of the Load Summary Section
nCol Int32
 Column number of Load Summary Section
Return Value
String
 The value of the Load Classification parameter
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given row number nRow is invalid in Summary. -or- The given column number nCol is invalid in Summary.
See Also
Reference
PanelScheduleView Class
Autodesk.Revit.DB.Electrical Namespace